testEdo/3D/combustorSimple/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    outerWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2560;
        startFace       75200;
    }
    outlet
    {
        type            outlet;
        nFaces          320;
        startFace       77760;
    }
    inlet
    {
        type            inlet;
        nFaces          320;
        startFace       78080;
    }
)

// ************************************************************************* //
